from enum import Enum

class Event(Enum):
    回合开始 = 0
    抽牌 = 1
    弃牌 = 31
    打出 = 2
    召唤 = 3
    施放前 = 4
    施放后 = 5
    放置奥秘 = 6
    揭示奥秘 = 7
    装备 = 8
    摧毁 = 9
    治疗 = 10
    受治疗 = 11
    受伤 = 12
    造成伤害 = 30
    死亡 = 13
    攻击 = 14
    受攻击 = 15
    英雄技能 = 16
    回合结束 = 20


class Target(Enum):
    #4位分别为：友、敌、随从、英雄
    #通过&排除获得角色代码
    不限 = 0b1111
    友方 = 0b1011
    敌方 = 0b0111
    随从 = 0b1110
    英雄 = 0b1101


class Role(Enum):
    #4位分别为：友、敌、随从、英雄
    友方 = 0b1000
    敌方 = 0b0100
    随从 = 0b0010
    英雄 = 0b0001
